app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Fred First Record"], ["email", "myemail@y.com"], ["comments", "This is a trial record"], ["created_at", 2017-03-03 23:39:20 UTC], ["updated_at", 2017-03-03 23:39:20 UTC]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save