app/controllers/profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "profiles" ("user_id", "first_name", "last_name", "job_title", "phone_number", "contact_email", "description", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "user_id" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["user_id", nil], ["updated_at", 2017-05-15 19:37:24 UTC], ["id", 2]]
---
  def create
    # Ensure that we have the user who is filling out form
    @user = User.find( params[:user_id] )
    # Create profile linked to this specific user
    @profile = @user.build_profile( profile_params )
    if @profile.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find( params[:user_id] )

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["avatar_file_name", "IMG_1946.JPG"], ["avatar_file_size", 1490387], ["avatar_updated_at", 2017-05-31 21:48:36 UTC], ["updated_at", 2017-05-31 21:48:37 UTC], ["id", 2]]
---
  def update
    # PUT /users/:user_id/profile
    @user = User.find( params[:user_id] )
    #retrieve that users profile
    @profile = @user.profile
    # mass assign user profile attributes and save
    if @profile.update_attributes(profile_params)