app/controllers/users_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    @users = User.includes(:profile)